Tekla Open API Reference for Tekla Structures 2025
BindPropertyNameEditor.GetEditStyle Method
 Gets the editor style used by the EditValue method.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override UITypeEditorEditStyle GetEditStyle(
	ITypeDescriptorContext context
)
Public Overrides Function GetEditStyle (
	context As ITypeDescriptorContext
) As UITypeEditorEditStyle
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
An ITypeDescriptorContext that can be used to gain additional context information.
Return Value
Type: UITypeEditorEditStyle
 A UITypeEditorEditStyle value that indicates the style of the editor used by the EditValue method. If the UITypeEditor does not support the method, then GetEditStyle will return None.
See Also
Reference
BindPropertyNameEditor Class
Tekla.Structures.Dialog Namespace